tap "hashicorp/tap"
tap "mongodb/brew"
# Universal Tool for DevOps and Cloud Automation
brew "atmos"
# Parser generator
brew "bison"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Application Platform based on Kubernetes and Open Application Model
brew "kubevela"
# Simple terminal UI for git commands
brew "lazygit"
# Implementations for atomic memory update operations
brew "libatomic_ops"
# Next-gen compiler infrastructure
brew "llvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Internet file retriever
brew "wget"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Neovim Client
cask "neovide-app"
# Open-source code editor
cask "visual-studio-code"
# Compatibility layer to run Windows applications
cask "wine-stable"
vscode "adam-bender.commit-message-editor"
vscode "donjayamanne.githistory"
vscode "donjayamanne.jquerysnippets"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-repositories"
vscode "ritwickdey.liveserver"
vscode "tht13.html-preview-vscode"
vscode "tomoki1207.pdf"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
npm "@babel/cli"
npm "concurrently"
npm "corepack"
npm "create-react-app"
npm "nodemon"
npm "react-scripts"
npm "serve"
npm "yarn"
